LouisPauchet/open-renewable-lab/sdkconfig.defaults
# Walter module is ESP32-S3 based.
CONFIG_IDF_TARGET="esp32s3"

# TODO: confirm exact flash/PSRAM size for your Walter module revision
# (datasheet/schematic) and adjust below if these defaults are wrong.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# No OTA in v1 - single factory app, larger NVS for the config blob + SPA assets in flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The Walter Feels schematic shows IO43/IO44 (UART0's default TX0/RX0
# pins) reused as 12V_EN/CAN_EN on the carrier board, not wired to the
# cellular modem - the modem link is apparently internal to the Walter
# module. Console output still defaults to USB-Serial-JTAG rather than
# a UART pin regardless: it's a clean choice for a headless field
# device either way and avoids relying on whichever UART the
# walter-modem library ends up claiming internally.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FreeRTOS / watchdog tuning - generous timeout since SDI-12 measurement
# commands can legitimately take several seconds; panic+reboot (rather
# than just log) on a genuine hang, appropriate for an unattended field
# deployment. Only the steady-timing tasks (aggregation, SD writer,
# MQTT publish) are registered with the watchdog - the SDI-12/I2C bus
# scheduler tasks have inherently variable, sensor-dependent blocking
# time and are deliberately left unregistered to avoid false trips.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_TASK_WDT_PANIC=y

# Networking
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# cJSON is used by config_store for the NVS-backed config blob.
CONFIG_JSON_USING_DOUBLE_PRECISION=y
